{
  "backend/main.mo": "Defines group, stage, and round‑robin stage config maps with methods to add groups/stages and create per‑stage advancement rules.",
  "backend/migration.mo": "Migrates old actor data into a new structure containing only group names, stage names, and empty round‑robin configs.",
  "feature_evidence.json": "Lists feature‑to‑file mappings showing where advancement logic, qualification, validation, and knockout behavior were implemented.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles in tournament generation, UI, state, and knockout logic.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes with global background and border rules.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Selects and renders the current tournament view (setup, schedule, knockout) and mounts global toasts.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "UI dialog for configuring per‑stage winner and runner‑up advancement destinations and saving them to the store.",
  "frontend/src/components/AppLayout.tsx": "Shared layout wrapper providing page structure and a footer with Caffeine attribution.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "React UI for configuring knockout pairing mode and manually assigning teams to first-round knockout matches.",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Small editor component allowing inline date/time updates for a match with validation.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Displays how teams advance between round‑robin stages based on advancement configs.",
  "frontend/src/features/tournament/generation.ts": "Generates round‑robin stages, distributes teams into groups, and determines team advancement between stages.",
  "frontend/src/features/tournament/groupNaming.ts": "Generates alphabetical group names, supporting single letters and extended pairs like AA/AB.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Builds knockout match brackets using qualified teams, pairing mode, and fixture assignments.",
  "frontend/src/features/tournament/matchCount.ts": "Computes total match counts for round‑robin and knockout phases with per‑stage breakdowns.",
  "frontend/src/features/tournament/qualification.ts": "Computes which teams qualify for knockout stages and counts how many qualify based on advancement rules.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates round-robin match pairings for all unique team combinations within a group.",
  "frontend/src/features/tournament/types.ts": "Defines all core tournament-related types including teams, groups, matches, stages, advancement rules, and knockout config.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Zustand store managing tournament state, advancement and knockout configs, and generation actions.",
  "frontend/src/features/tournament/validation.ts": "Validation helpers for team counts, round configs, advancement rules, dates, times, and displaying advancement labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and persistent identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend-related query utilities.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React, query client, identity provider, and global styles.",
  "frontend/src/pages/KnockoutPage.tsx": "Displays and manages knockout-stage rounds, match groupings, qualified team counts, and compatibility validation errors.",
  "frontend/src/pages/StageSchedulePage.tsx": "Shows round-robin stages with expandable groups and allows editing match date/time per group.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Handles tournament configuration including team count, round settings, advancement rules, validation, and triggering tournament generation.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugin usage for the frontend.",
  "project_state.json": "Describes the project’s current architecture, requirements, known issues, and feature-state metadata."
}