{
  "backend/main.mo": "Actor storing groups, stages, and round‑robin configs with functions to add groups, add stages, and save advancement rules for a round‑robin stage.",
  "feature_evidence.json": "JSON report listing feature evidence, affected files, and confidence for multiple tournament‑related frontend features.",
  "frontend-file-summaries.txt": "Prewritten one‑line summaries describing the purpose of various frontend tournament files.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global background/foreground styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Selects and renders the active tournament page based on current view from the Zustand store and includes global toasts.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "Dialog allowing configuration of per‑stage winner and runner‑up advancement destinations with validation and state persistence.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper adding container, gradient background, and footer attribution around page content.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Editor for automatic or manual assignment of qualified teams into the first knockout‑round fixtures.",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Small input component for editing a match’s date and time, updating store state on change.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "UI component for editing round-robin group names, team names, and team positions with inline inputs and store updates.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Displays a preview of how teams advance between round‑robin stages based on configured advancement rules.",
  "frontend/src/features/tournament/export.ts": "Utility to export a stage’s group and team data to a downloadable JSON file.",
  "frontend/src/features/tournament/generation.ts": "Generates all round‑robin stages, groups, and matches and determines advancing teams for subsequent rounds.",
  "frontend/src/features/tournament/groupNaming.ts": "Creates alphabetic group names (A, B, …, AA, AB, …) based on an index.",
  "frontend/src/features/tournament/groupReorder.ts": "Reorders teams within a group by moving a team to a target position while preserving unique ordering.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Builds knockout bracket matches using qualified teams, stage configs, and pairing modes.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines knockout round name constants and utilities for ordering and validating round names.",
  "frontend/src/features/tournament/matchCount.ts": "Computes the number of matches across round‑robin and knockout stages and provides per‑stage breakdowns.",
  "frontend/src/features/tournament/qualification.ts": "Computes which teams qualify for knockout stages and counts qualifiers based on advancement rules and enabled knockout rounds.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates round‑robin match pairings for a group by producing all unique team matchups.",
  "frontend/src/features/tournament/types.ts": "Defines core tournament types including teams, groups, stages, advancement rules, knockout settings, and global tournament state.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Zustand store handling tournament configuration, generation, updates, and knockout match creation with persistence.",
  "frontend/src/features/tournament/validation.ts": "Provides validation utilities for team counts, round configs, advancement rules, date/time formats, and advancement label formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context and provider, handling login, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend query integration.",
  "frontend/src/index.css": "Tailwind-based global styling with CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays the full tournament schedule, grouping round-robin and knockout matches by stage and round with navigation to groups or knockout view.",
  "frontend/src/pages/KnockoutPage.tsx": "Shows knockout bracket stages, validates qualified team counts, groups matches by round, and provides reset and navigation controls.",
  "frontend/src/pages/StageSchedulePage.tsx": "Lists all round-robin stages with editable group tables and navigation to full schedule, setup, or reset.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Handles tournament setup including team count, round configs, advancement rules, knockout settings, and generation/reset workflows.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing round-robin group naming rules, feature requirements, and current development status."
}