{
  "backend/main.mo": "Main Motoko actor implementing tournament and user profile management with CRUD operations for tournaments, groups, and stages; includes authorization mixin and access control for user permissions.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to restoring and fixing the TournamentListDialog component's tournament list display and state management issues.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, stores, utilities, and tournament generation logic with details on functionality and recent fixes.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and a descriptive title for the multi-stage cricket tournament draw app.",
  "frontend/src/App.tsx": "Root React component that renders AppHeader and conditionally displays pages (setup, schedule, fullSchedule, knockout, profile) based on currentView state from the tournament store, with toast notifications.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "Modal dialog component for configuring stage advancement rules, allowing users to set winner and runner-up destinations to next stages, knockout entry points, or elimination with validation and stage-aware options.",
  "frontend/src/components/AppHeader.tsx": "Application header component with Tournament Manager branding, profile navigation button, and login/logout authentication toggle using Internet Identity integration.",
  "frontend/src/components/AppLayout.tsx": "Shared layout wrapper providing responsive container with gradient background, consistent padding, and footer with caffeine.ai attribution and copyright notice.",
  "frontend/src/components/DeleteTournamentDialog.tsx": "A confirmation dialog component that handles tournament deletion with loading state, error handling, and success/error toasts using the useDeleteTournament mutation hook.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Manages knockout stage pairing configuration with auto/manual modes, displays qualified teams from group stages, allows manual fixture assignments, validates pairings for rematches, and shows warnings.",
  "frontend/src/components/KnockoutWinnerSelector.tsx": "Renders winner selection buttons for knockout matches, hiding the selector when either team is a placeholder (TBD) and highlighting the currently selected winner.",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Provides date and time input fields for editing match scheduling information, updating the tournament store on change.",
  "frontend/src/components/NewTournamentButton.tsx": "A button that resets the tournament state, showing a confirmation dialog if a tournament has already been generated to prevent accidental data loss.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "Displays round-robin groups in a grid layout with inline editing for team names, group names, and team positions, including validation and toast notifications.",
  "frontend/src/components/SaveTournamentDialog.tsx": "A dialog for saving tournament configurations either as a new tournament or updating an existing one, serializing groups and stages and using mutation hooks to persist data.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Visualizes the flow of teams between round-robin stages and knockout, showing winner and runner-up destinations with icons and badges for each stage.",
  "frontend/src/components/TournamentListDialog.tsx": "Dialog component for managing tournaments with list view, inline rename, delete, and load functionality. Fetches all tournaments from backend and deserializes them into the tournament store.",
  "frontend/src/components/UserTournamentCard.tsx": "Card component displaying tournament summary (name, date, groups, stages) with a load button. Fetches full tournament data and deserializes it into the store on click.",
  "frontend/src/features/tournament/deserialization.ts": "Deserializes backend TournamentView into frontend tournament state including groups, stages, advancement configs, and round robin rounds. Handles both NextStage and KnockoutEntry advancement rules.",
  "frontend/src/features/tournament/export.ts": "Frontend-only utility to export Robin Round 1 stage data (groups and teams) as a downloadable JSON file without backend calls.",
  "frontend/src/features/tournament/generation.ts": "Generates multi-round tournament stages with deterministic seeding, creating groups with sequential naming and round-robin matches. Advances teams between stages based on advancement configs.",
  "frontend/src/features/tournament/groupNaming.ts": "Generates Excel-style alphabetical group names (A-Z, AA-AZ, BA-BZ, etc.) supporting unlimited groups across all robin rounds using base-26 naming.",
  "frontend/src/features/tournament/groupReorder.ts": "Reorders teams within a group by moving a team to a target position, maintaining unique positions 1..N through deterministic swapping.",
  "frontend/src/features/tournament/knockoutFixtureCode.ts": "Generates knockout fixture codes (PQ1, Q2, S1, F1) based on round name and match index within the round.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Generates knockout stage matches from qualified robin round teams with metadata tracking (winner/runner-up status, group origin). Implements pairing logic to avoid same-group matchups when possible.",
  "frontend/src/features/tournament/knockoutPlaceholders.ts": "Provides utilities to detect, normalize, and display placeholder team names (TBD, fixture codes like PQ1/Q2/S1/F1, or legacy 'Winner of X' patterns) in knockout brackets.",
  "frontend/src/features/tournament/knockoutReseeding.ts": "Implements knockout bracket reseeding logic that optimizes team placement to avoid rematches, same-group matchups, and winner-vs-winner pairings, with scoring and warning generation.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines canonical knockout round constants (Pre-Quarterfinal, Quarterfinal, Semifinal, Final) with utilities for ordering, validation, and determining the first enabled round.",
  "frontend/src/features/tournament/knockoutWinners.ts": "Handles propagation of knockout match winners to downstream matches using stable upstream fixture references, and clears affected downstream winners when upstream results change.",
  "frontend/src/features/tournament/matchCount.ts": "Calculates total match counts for tournaments, breaking down round-robin matches by stage/group and knockout matches by round based on configuration.",
  "frontend/src/features/tournament/originGroupSerial.ts": "Resolves a team's origin group serial (e.g., 'A-2') by finding the earliest stage where the team appears, used for display formatting in later stages.",
  "frontend/src/features/tournament/qualification.ts": "Computes qualified teams for knockout stages based on per-stage advancement configurations, determining which winners and runner-ups advance to which knockout entry points.",
  "frontend/src/features/tournament/roundRobinDisplayCode.ts": "Generates display codes for teams in round-robin matches (e.g., 'A1'), with special handling for Stage 2 that uses origin group serials with hyphens.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates all unique round-robin match pairings for a group by creating matches between every pair of teams.",
  "frontend/src/features/tournament/serialization.ts": "Serializes frontend tournament stage and group data into backend-compatible types, converting advancement rules (NextStage, KnockoutEntry, Eliminated) and aggregating groups/stages with BigInt IDs.",
  "frontend/src/features/tournament/types.ts": "Defines TypeScript types for tournament entities (Team, Group, Match, Stage) and configuration (advancement destinations, knockout stages, round-robin rounds, pairing modes, warnings, and the main TournamentState).",
  "frontend/src/features/tournament/useTournamentStore.ts": "Zustand store managing tournament state with persistence, including team/match/stage management, knockout generation, reseeding, winner tracking, and migration logic for match source references.",
  "frontend/src/features/tournament/validation.ts": "Validates tournament configuration inputs (team counts, group counts, round configs, advancement rules) and provides formatting utilities for displaying advancement destinations and stage labels.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication via Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for tournament CRUD operations (get, create, update, delete tournaments/groups/stages) and user profile management, with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, buttons, and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays complete tournament schedule including round-robin and knockout stages with match details, winner selection, and save functionality requiring Internet Identity authentication.",
  "frontend/src/pages/KnockoutPage.tsx": "Manages knockout stage view with match brackets organized by rounds, winner selection, validation of qualified team counts, and tournament reset functionality.",
  "frontend/src/pages/StageSchedulePage.tsx": "Displays round-robin group stages with editable group and team names, provides navigation to full schedule view, and includes reset functionality with confirmation dialog.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Main tournament configuration page for setting team count, round-robin rounds, group counts, advancement rules, knockout stages, and generating tournaments with validation and save/load capabilities.",
  "frontend/src/pages/UserProfilePage.tsx": "User profile management page displaying username, join date, privacy settings, and user's tournaments list, requiring Internet Identity authentication to access.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state tracking a fix request for a blank screen issue in the tournament list display (Draft 47) caused by broken clickable tournament names functionality and frontend state management problems."
}