{
  "backend/main.mo": "Defines types for advancement rules and manages groups, stages, and round‑robin stage configs with add and create operations.",
  "feature_evidence.json": "Feature evidence report linking a knockout bracket fix to the specific frontend generator file and project components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend tournament-related files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and applying global background and text styles.",
  "frontend/index.html": "Base HTML page bootstrapping the React app with a root div and main.tsx entry script.",
  "frontend/src/App.tsx": "Routes between setup, schedule, full schedule, and knockout views using tournament store state.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "Dialog UI for configuring per-stage winner and runner‑up advancement destinations with selectable NextStage/Knockout/Eliminated options.",
  "frontend/src/components/AppLayout.tsx": "Provides the main layout wrapper with container styling and footer attribution.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Allows auto or manual assignment of teams to first‑round knockout fixtures using store state and qualification utilities.",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Component for editing match date and time, persisting updates to the tournament store.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "Displays round‑robin groups with editable team names and consistent row heights across groups.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Shows a preview of how winners and runners‑up advance between round‑robin stages based on configs.",
  "frontend/src/features/tournament/export.ts": "Builds a JSON export of the current stage and triggers a file download of group and team data.",
  "frontend/src/features/tournament/generation.ts": "Generates all round‑robin stages, groups, and matches, and computes team advancement for each stage.",
  "frontend/src/features/tournament/groupNaming.ts": "Generates group names using A–Z and extended patterns like AA, AB for higher indexes.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Builds knockout bracket matches by pairing qualified teams across rounds with support for auto/manual assignment.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines knockout round names, order, and helper functions for identifying and indexing rounds.",
  "frontend/src/features/tournament/matchCount.ts": "Calculates total match counts across round‑robin and knockout stages with per‑stage breakdowns.",
  "frontend/src/features/tournament/qualification.ts": "Determines which teams qualify for knockout rounds based on per‑stage advancement rules.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates round-robin match pairings for a group by creating all unique team combinations. Returns Match objects with IDs and metadata.",
  "frontend/src/features/tournament/types.ts": "Defines interfaces for teams, groups, matches, stages, advancement rules, and tournament state structures. Used throughout scheduling and knockout configuration.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Provides a Zustand store managing tournament configuration, generation, match updates, and knockout settings. Persists state and coordinates generation functions.",
  "frontend/src/features/tournament/validation.ts": "Validates team counts, group configs, advancement rules, and date/time formats. Also formats advancement destinations and labels for display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, refetching dependent queries when the actor changes. Uses React Query for lifecycle management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with context, including login, logout, identity loading, and auth-client configuration. Exposes identity state and helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for backend-related query logic with no current implementation.",
  "frontend/src/index.css": "Defines Tailwind base, component, and utility layers plus CSS variables for light and dark themes. Applies global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider. Renders the root App component.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays the full tournament schedule including round-robin stages and grouped knockout matches. Provides navigation to group view and knockout view.",
  "frontend/src/pages/KnockoutPage.tsx": "Displays knockout-stage matches grouped by round, validates qualified team counts, and provides navigation and reset controls.",
  "frontend/src/pages/StageSchedulePage.tsx": "Shows stage group assignments with editing and navigation options, plus a reset confirmation dialog.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Handles initial tournament setup including team count, round configs, advancement rules, and regeneration/reset prompts.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "Project metadata describing current state, known issues, and required fix for knockout bracket match counts."
}