{
  "backend/main.mo": "Defines types for advancement rules and round-robin configs, and provides functions to add groups, stages, and store round‑robin stage configurations.",
  "feature_evidence.json": "Lists implemented features with associated frontend files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base setup defining light/dark theme CSS variables and applying shared styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Routes between setup, schedule, full schedule, and knockout views based on store state and includes a toaster.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "UI dialog allowing users to configure per‑stage winner and runner‑up advancement destinations.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing page container styling and footer with attribution.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Editor for automatic or manual pairing of teams in the first knockout round using qualification data.",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Small editor component for setting a match’s date and time with store updates.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "Renders editable round-robin groups with inline team name editing and consistent row heights per group.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Displays a preview of how winners and runner-ups advance across stages using store configuration.",
  "frontend/src/features/tournament/export.ts": "Builds and downloads a JSON export of a stage’s groups and team names.",
  "frontend/src/features/tournament/generation.ts": "Generates all round-robin stages, groups, and matches, then constructs knockout matches based on advancement rules.",
  "frontend/src/features/tournament/groupNaming.ts": "Provides alphabetical group naming utilities with optional offset for multi‑stage continuity.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Creates knockout bracket matches using qualified teams, supporting multiple rounds and pairing modes.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines canonical knockout round names, order, and helper functions for round identification.",
  "frontend/src/features/tournament/matchCount.ts": "Computes total match counts across all round‑robin and knockout stages with detailed breakdowns.",
  "frontend/src/features/tournament/qualification.ts": "Computes which teams qualify for knockout rounds and counts how many advance based on stage advancement rules.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates all round-robin match pairings within a group for a given stage.",
  "frontend/src/features/tournament/types.ts": "Defines all tournament-related data types including teams, stages, advancement rules, and knockout structures.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Zustand store managing tournament state, configuration, team generation, match updates, and knockout settings.",
  "frontend/src/features/tournament/validation.ts": "Validates team counts, round configs, advancement rules, and formats advancement labels for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for backend query integration; currently empty.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Sets up the React app root with query and identity providers before rendering the main App component.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays the full tournament schedule, grouping knockout matches by round and showing round‑robin stages with their groups and matches.",
  "frontend/src/pages/KnockoutPage.tsx": "Shows the knockout bracket, validates qualified team counts, groups matches by round, and provides navigation and reset controls.",
  "frontend/src/pages/StageSchedulePage.tsx": "Shows stage 1 group assignments with editable team names and navigation to the full schedule or setup, including a reset option.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Handles tournament configuration including team counts, round-robin setups, advancement rules, knockout stages, and generation/reset actions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing app state, features, requirements, and advancement rules for the tournament system."
}