{
  "backend/main.mo": "Main Motoko actor implementing tournament management with authorization, access control, and CRUD operations for tournaments, groups, stages, and user profiles; includes helpers for converting mutable state to immutable views and ownership checks.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: tournament loading mechanism fixes in TournamentListDialog and tournament deserialization logic verification in useTournamentStore with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/TSX files covering tournament state management, generation logic, UI components, pages, and validation utilities with details on recent fixes and enhancements.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, destructive, borders, charts, sidebar) using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title describing a multi-stage cricket tournament draw app with round-robin and knockout stages.",
  "frontend/src/App.tsx": "Root React component rendering AppHeader and conditionally displaying TournamentSetupPage, StageSchedulePage, FullSchedulePage, KnockoutPage, or UserProfilePage based on currentView state with toast notifications.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "Modal dialog component for configuring stage advancement rules allowing users to set winner and runner-up destinations (NextStage, KnockoutEntry, or Eliminated) with validation and conditional UI based on stage position.",
  "frontend/src/components/AppHeader.tsx": "Application header component with Tournament Manager branding, Profile button, and Login/Logout button integrating Internet Identity authentication and navigation to profile view.",
  "frontend/src/components/AppLayout.tsx": "Shared layout wrapper providing responsive container with gradient background, consistent padding, and footer with caffeine.ai attribution link and copyright notice.",
  "frontend/src/components/DeleteTournamentDialog.tsx": "A confirmation dialog component that handles tournament deletion with loading states and success/error toast notifications.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Manages knockout stage pairing configuration with auto/manual modes, team assignment to matches, validation warnings, and rematch avoidance logic.",
  "frontend/src/components/KnockoutWinnerSelector.tsx": "Displays buttons to select the winner of a knockout match, hiding the selector if either team is a placeholder (TBD).",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Provides date and time input fields for editing match scheduling information.",
  "frontend/src/components/NewTournamentButton.tsx": "A button that resets the tournament state, showing a confirmation dialog if a tournament has already been generated.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "Displays round-robin groups in a grid with inline editing for team names, positions, and group names, including origin group serial display.",
  "frontend/src/components/SaveTournamentDialog.tsx": "A dialog for saving tournament configurations either as a new tournament or updating an existing one, serializing groups and stages to the backend.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Visualizes the flow of teams between round-robin stages and knockout, showing winner and runner-up destinations for each stage.",
  "frontend/src/components/TournamentListDialog.tsx": "Dialog component for managing tournaments with table view, allowing users to load, rename, and delete saved tournaments with inline editing and confirmation dialogs.",
  "frontend/src/components/UserTournamentCard.tsx": "Card component displaying tournament summary (name, creation date, groups, stages) with a load button to deserialize and load the tournament into the store.",
  "frontend/src/features/tournament/deserialization.ts": "Deserializes backend TournamentView data into frontend tournament state, reconstructing groups, stages, advancement configs, round robin rounds, and knockout stage configuration.",
  "frontend/src/features/tournament/export.ts": "Frontend-only utility to export Robin Round 1 stage groups and teams to a downloadable JSON file without backend calls.",
  "frontend/src/features/tournament/generation.ts": "Generates multi-stage round-robin tournament structures with deterministic seeding, creating groups and matches based on round configs and advancement rules.",
  "frontend/src/features/tournament/groupNaming.ts": "Generates Excel-style alphabetical group names (A-Z, AA-AZ, BA-BZ, etc.) supporting unlimited groups across tournament rounds.",
  "frontend/src/features/tournament/groupReorder.ts": "Reorders teams within a group by moving a team to a target position, maintaining unique positions 1 through N.",
  "frontend/src/features/tournament/knockoutFixtureCode.ts": "Generates knockout fixture codes (PQ1, Q2, S1, F1) for matches based on round name and index within the round.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Generates knockout stage matches from qualified round-robin teams, supporting multiple pairing modes (winner-vs-runner-up, reseeding) and fixture assignments with validation warnings.",
  "frontend/src/features/tournament/knockoutPlaceholders.ts": "Provides utilities to detect, normalize, and display placeholder team names (TBD, fixture codes like PQ1/Q2/S1/F1, or legacy 'Winner of X' patterns) in knockout brackets.",
  "frontend/src/features/tournament/knockoutReseeding.ts": "Implements knockout bracket reseeding logic that optimizes team placement to avoid rematches, same-group matchups, and winner-vs-winner pairings, with scoring and warning generation.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines canonical knockout round constants (Pre-Quarterfinal, Quarterfinal, Semifinal, Final) with ordering and utilities for round name validation and indexing.",
  "frontend/src/features/tournament/knockoutWinners.ts": "Handles propagation of knockout match winners through the bracket using stable upstream fixture references, and clears downstream winners when upstream results change.",
  "frontend/src/features/tournament/matchCount.ts": "Calculates total match counts and breakdowns for round-robin and knockout stages based on team count, group configurations, and advancement rules.",
  "frontend/src/features/tournament/originGroupSerial.ts": "Resolves a team's origin group serial (e.g., 'A-2') by finding the earliest stage where the team appears, used for team display formatting.",
  "frontend/src/features/tournament/qualification.ts": "Computes qualified teams for knockout stages based on per-stage advancement configurations, determining which winners and runner-ups advance to knockout entry points.",
  "frontend/src/features/tournament/roundRobinDisplayCode.ts": "Generates display codes (e.g., 'A1') for teams in round-robin matches based on group position, with special handling for Stage 2 using origin group serials.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates all unique round-robin match pairings for a given group by creating matches between every pair of teams.",
  "frontend/src/features/tournament/serialization.ts": "Serializes tournament stages and groups into backend-compatible types, converting advancement rules (NextStage, KnockoutEntry, Eliminated) and round-robin configurations to the backend's StageType format.",
  "frontend/src/features/tournament/types.ts": "Defines TypeScript types for tournament entities including teams, groups, matches, stages, advancement configurations, knockout stages, and the main TournamentState interface with multi-round and knockout support.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Zustand store managing tournament state with persistence, including team/match management, round-robin and knockout configuration, advancement rules, fixture assignments, and tournament generation/loading logic with migration support.",
  "frontend/src/features/tournament/validation.ts": "Provides validation functions for tournament configuration including team counts, group counts, round configs, advancement rule compatibility, and date/time formats, plus helper functions for formatting advancement destinations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with authentication, automatically invalidating and refetching dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for tournament CRUD operations (get, create, update, delete) and user profile management, integrating with the backend actor and handling query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including colors for UI components (primary, secondary, destructive, etc.) and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays complete tournament schedule including round-robin and knockout stages with match details, winner selection, and save functionality requiring Internet Identity authentication.",
  "frontend/src/pages/KnockoutPage.tsx": "Manages knockout stage view with match brackets organized by rounds, winner selection, validation of qualified team counts, and tournament reset functionality.",
  "frontend/src/pages/StageSchedulePage.tsx": "Displays round-robin group stages with editable group and team names, provides navigation to full schedule view, and includes reset functionality with confirmation dialog.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Main tournament configuration page for setting team count, round-robin rounds, group counts, advancement rules, knockout stages, and includes save/load/reset functionality with validation.",
  "frontend/src/pages/UserProfilePage.tsx": "User profile management page displaying username, join date, privacy settings, and user's tournaments list, requiring Internet Identity authentication to access.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations for accordions, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking file documenting a cricket tournament management app with known issues around tournament loading functionality (data not populating after load) and previous delete button errors."
}