{
  "backend/main.mo": "Main Motoko actor implementing tournament CRUD operations with authorization mixin; manages tournaments with draws/stages/groups, user profiles, and owner-based access control for modifications.",
  "feature_evidence.json": "Feature evidence report documenting the tournament loading fix in TournamentListDialog and useTournamentStore with high confidence mapping to test REQ-1.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files including components, pages, stores, and utilities for tournament management with round-robin and knockout stages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including colors for background, foreground, primary, secondary, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag and title describing a cricket tournament draw app with multi-stage round-robin, knockout, and scheduling features.",
  "frontend/src/App.tsx": "Root React component rendering AppHeader and conditionally displaying setup, schedule, full schedule, knockout, or profile pages based on currentView state with toast notifications.",
  "frontend/src/components/AdvancementConfigDialog.tsx": "Modal dialog for configuring stage advancement rules where users select winner and runner-up destinations (next round-robin stage, knockout entry point, or elimination) with validation and info alerts.",
  "frontend/src/components/AppHeader.tsx": "Header component with Tournament Manager branding, profile button, and login/logout authentication toggle using Internet Identity integration.",
  "frontend/src/components/AppLayout.tsx": "Shared layout wrapper providing responsive container with gradient background and footer attribution to caffeine.ai with dynamic UTM parameters.",
  "frontend/src/components/DeleteTournamentDialog.tsx": "Alert dialog component for confirming tournament deletion with loading state, error handling, and success toast notifications using the useDeleteTournament mutation hook.",
  "frontend/src/components/KnockoutPairingEditor.tsx": "Provides UI for configuring knockout stage first-round pairings with auto/manual modes, team assignment to matches, validation warnings, and rematch avoidance logic.",
  "frontend/src/components/KnockoutWinnerSelector.tsx": "Renders buttons to select the winner of a knockout match, hiding the selector if either team is a placeholder (TBD).",
  "frontend/src/components/MatchDateTimeEditor.tsx": "Provides date and time input fields for editing match scheduling information.",
  "frontend/src/components/NewTournamentButton.tsx": "Button that resets the tournament store to start a new tournament, with a confirmation dialog if a tournament is already generated.",
  "frontend/src/components/RoundRobinGroupTable.tsx": "Displays round-robin groups in a grid with inline editing for team names, group names, and team positions within groups.",
  "frontend/src/components/SaveTournamentDialog.tsx": "Dialog for saving tournament configuration to the backend, supporting both creating new tournaments and updating existing ones with serialized groups and stages.",
  "frontend/src/components/Stage2GroupAssignmentPanel.tsx": "Visualizes the flow of teams between round-robin stages and to knockout, showing winner and runner-up destinations for each stage.",
  "frontend/src/components/TournamentListDialog.tsx": "Dialog component for managing tournaments with table view, supporting load, rename (inline editing), and delete operations with loading states and toast notifications.",
  "frontend/src/components/UserTournamentCard.tsx": "Card component displaying tournament summary (name, date, groups, stages) with a load button that deserializes and loads the tournament into the store.",
  "frontend/src/features/tournament/deserialization.ts": "Deserializes backend TournamentView into frontend tournament state, converting groups, stages, advancement rules, and round-robin configurations.",
  "frontend/src/features/tournament/export.ts": "Frontend-only utility to export Robin Round 1 stage data (groups and teams) as a downloadable JSON file without backend calls.",
  "frontend/src/features/tournament/generation.ts": "Generates multi-stage tournament structures with round-robin groups, deterministic seeding across rounds, and sequential group naming based on advancement configurations.",
  "frontend/src/features/tournament/groupNaming.ts": "Generates Excel-style alphabetical group names (A-Z, AA-AZ, BA-BZ, etc.) supporting unlimited groups across all rounds.",
  "frontend/src/features/tournament/groupReorder.ts": "Reorders teams within a group by moving a team to a target position, maintaining unique positions 1 through N.",
  "frontend/src/features/tournament/knockoutFixtureCode.ts": "Generates and parses knockout fixture codes (PQ1, Q2, S1, F1) for pre-quarterfinals, quarterfinals, semifinals, and finals.",
  "frontend/src/features/tournament/knockoutGenerator.ts": "Generates knockout stage matches from qualified teams with metadata, supporting winner-vs-runner-up pairing and same-group avoidance logic.",
  "frontend/src/features/tournament/knockoutPlaceholders.ts": "Utilities to detect, normalize, and display placeholder team names (TBD or fixture codes like PQ1) in knockout brackets.",
  "frontend/src/features/tournament/knockoutReseeding.ts": "Implements knockout bracket reseeding logic that optimizes team pairings by avoiding same-group matchups, rematches, and winner-vs-runner-up violations using a scoring system and permutation search.",
  "frontend/src/features/tournament/knockoutRounds.ts": "Defines canonical knockout round constants (Pre-Quarterfinal, Quarterfinal, Semifinal, Final) and utilities for round ordering, validation, and determining the first enabled round.",
  "frontend/src/features/tournament/knockoutWinners.ts": "Handles propagation of knockout match winners through the bracket using stable upstream fixture references and clears downstream winners when upstream results change.",
  "frontend/src/features/tournament/matchCount.ts": "Calculates total match counts for tournaments, breaking down round-robin matches by stage and knockout matches by round based on team counts and advancement configurations.",
  "frontend/src/features/tournament/originGroupSerial.ts": "Resolves a team's origin group serial (e.g., 'A-2') by finding the earliest stage where the team appears and provides formatted display strings with origin prefixes.",
  "frontend/src/features/tournament/qualification.ts": "Computes qualified teams for knockout stages based on per-stage advancement configurations, determining which winners and runner-ups advance to the first enabled knockout entry point.",
  "frontend/src/features/tournament/roundRobinDisplayCode.ts": "Generates display codes for teams in round-robin matches (e.g., 'A1') and formats team displays with appropriate prefixes, using origin serials for Stage 2 matches.",
  "frontend/src/features/tournament/roundRobinScheduler.ts": "Generates all unique round-robin match pairings for a group by creating matches between every pair of teams.",
  "frontend/src/features/tournament/serialization.ts": "Serializes tournament stages and groups into backend-compatible types, converting advancement configurations into typed advancement rules for API communication.",
  "frontend/src/features/tournament/types.ts": "Defines TypeScript interfaces and types for tournament data structures including teams, groups, matches, stages, advancement configurations, knockout stages, and the main TournamentState. Includes support for multi-round robin, knockout pairings, fixture assignments, and winner tracking.",
  "frontend/src/features/tournament/useTournamentStore.ts": "Implements a Zustand store with persistence for tournament state management, providing actions for team/match/group updates, tournament generation, knockout configuration, winner tracking, and data migration. Includes a migration function to add stable source references to legacy matches.",
  "frontend/src/features/tournament/validation.ts": "Provides validation functions for tournament configuration including team counts, group counts, round configs, advancement rules, and date/time formats. Also includes formatting utilities for displaying advancement destinations and stage labels.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, handling authentication state changes and initializing access control with an admin token. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Creates and configures AuthClient with custom options including derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for tournament and user profile CRUD operations including fetching tournaments, creating/updating/deleting tournaments, managing stages and groups, and handling user profile privacy settings. All mutations invalidate relevant query caches.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/FullSchedulePage.tsx": "Displays the complete tournament schedule including round-robin stages and knockout matches, with winner selection functionality and authentication-gated save feature. Groups knockout matches by round in canonical order and formats team displays with origin group serial prefixes.",
  "frontend/src/pages/KnockoutPage.tsx": "Manages the knockout stage view with match progression, winner selection, and validation that qualified team count matches required count for selected knockout stages. Includes reset functionality with confirmation dialog and formats team displays with origin group serial prefixes.",
  "frontend/src/pages/StageSchedulePage.tsx": "Displays round-robin group tables for all tournament stages with inline editing of group and team names. Provides navigation to full schedule view and reset functionality with confirmation dialog.",
  "frontend/src/pages/TournamentSetupPage.tsx": "Main tournament configuration page for setting team count, round-robin rounds, group counts, advancement rules, and knockout stages. Handles tournament generation, validation, and includes save/load functionality with confirmation dialogs for regeneration and reset.",
  "frontend/src/pages/UserProfilePage.tsx": "User profile management page displaying username, join date, privacy settings, and user's tournaments. Requires authentication and provides inline username editing and privacy toggle functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project state metadata tracking a cricket tournament management app with known issues including tournament loading failures and a fix request in progress to properly populate tournament data when loading saved tournaments."
}