{
  "kind": "build_request",
  "title": "Fix knockout bracket match counts after Pre-Quarterfinal",
  "projectName": "Tournament Scheduler",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix knockout bracket generation so that after Pre-Quarterfinal (8 matches), subsequent rounds generate the standard single-elimination counts: Quarterfinal = 4 matches, Semifinal = 2 matches, Final = 1 match, instead of repeating 8 matches each round.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Pre q means 8 match\nQ means 4 match\nSemi means 2 match\nFinal means 1 match\nIts standard"
        ]
      },
      "acceptanceCriteria": [
        "When knockoutStages.preQuarterFinal, quarterFinal, semiFinal, and final are enabled and 16 real teams enter Pre-Quarterfinal, generateKnockoutMatches returns 8 Pre-Quarterfinal matches, 4 Quarterfinal matches, 2 Semifinal matches, and 1 Final match.",
        "The teams carried forward between rounds represent winners only (i.e., after a round with N matches, the next round starts with N placeholder teams), so the next round match count is always half of the prior round’s match count.",
        "KnockoutPage displays the corrected per-round match badges (e.g., Quarterfinal shows “4 matches”, Semifinal shows “2 matches”, Final shows “1 match”) for the same configuration.",
        "The fix does not change qualification logic (which teams qualify) or round naming (Pre-Quarterfinal, Quarterfinal, Semifinal, Final) beyond correcting match counts."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Keep all changes within the existing React + TypeScript frontend; no new backend dependencies or external services."
  ],
  "nonGoals": [
    "Changing how teams qualify for knockout (advancement configuration rules).",
    "Adding new knockout rounds or changing existing round names.",
    "Implementing match result entry and propagation of actual winners through the bracket (beyond using TBD placeholders)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}