{
  "kind": "build_request",
  "title": "Enforce unique sequential group letters across round-robin rounds + editable group names",
  "projectName": "Tournament Builder",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update round-robin stage generation so group letters are assigned sequentially across rounds (e.g., if Robin Round 1 has 12 groups A–L, then Robin Round 2 with 4 groups must be M–P), rather than restarting at A each round.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Round 1 Group if 12 teams than A to L and round 2 group if 4 its also A to D but it should Be M to P"
        ]
      },
      "acceptanceCriteria": [
        "Given roundRobinRounds = [{roundNumber:1, groupCount:12},{roundNumber:2, groupCount:4}], generated stage-1 group names are A through L and generated stage-2 group names are M through P.",
        "Group naming continues correctly across any number of rounds by offsetting the group-name index by the total number of groups in prior rounds.",
        "No generated group name is duplicated across all generated stages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the ability for users to manually rename a group name/letter in the round-robin group UI, while blocking any rename that would reuse an existing group name used anywhere else in the tournament (including names used in Robin Round 1).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "system assigned but user can change manually",
          "Robin Round 2 Group Name should not repeated as a Is in robin round 1",
          "2-Block"
        ]
      },
      "acceptanceCriteria": [
        "Group headers in the round-robin groups UI can be switched into an editable state and saved by the user.",
        "If the user attempts to rename a group to a name already used by any other group in any stage, the UI blocks the change and shows a clear English error message.",
        "If the user renames a group to a unique value, the updated group name is reflected everywhere that group name is shown (e.g., group tables and schedule views) without requiring a regeneration reset."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Extend the tournament client state/store with an action to update a group name (by stageId + groupId) and ensure downstream displays (serial numbers, schedules) reflect the updated group name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "system assigned but user can change manually"
        ]
      },
      "acceptanceCriteria": [
        "There is a store action to update a specific group name identified by stageId and groupId.",
        "Updating a group name updates the group in the relevant stage in state and causes React views using that state to re-render accordingly.",
        "Existing behaviors for updating team names and team positions remain unchanged."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure Robin Round 2 groups show the same team serial numbering format and the same dropdown control to rearrange team positions as in Robin Round 1.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and in robin round 2 group the same serial number as in group of robin round 1 and the same drop down to rearrange teams position"
        ]
      },
      "acceptanceCriteria": [
        "For any stage (including Robin Round 2), each team row shows a serial number in the format \"{groupName}-{position}\" consistent with Robin Round 1.",
        "For any stage (including Robin Round 2), each team row includes the position dropdown and changing it reorders the teams within that group.",
        "After a group rename, serial numbers update to use the new group name."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths must not be edited directly; compose them instead.",
    "Keep all backend logic in a single Motoko actor; do not introduce additional backend services. (No backend change is required for this request.)"
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time multiplayer or websocket-based updates.",
    "Persisting tournament state to the backend canister (this change should remain in the existing client-side store unless separately requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}