{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tournament Builder: sequential group letters across rounds + unique editable group names",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Assign round-robin group letters sequentially across all rounds so later rounds continue from prior rounds’ last group.",
      "acceptanceCriteria": [
        "Given roundRobinRounds = [{roundNumber:1, groupCount:12},{roundNumber:2, groupCount:4}], generated stage-1 group names are A through L and generated stage-2 group names are M through P.",
        "Group naming continues correctly across any number of rounds by offsetting the group-name index by the total number of groups in prior rounds.",
        "No generated group name is duplicated across all generated stages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tournament/generation.ts",
          "operation": "modify",
          "description": "Update round-robin group creation to compute a running group-name offset (sum of groupCount from prior rounds) and call generateGroupName(offset + g) so group letters continue sequentially across stages."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Allow users to rename round-robin group names inline while preventing duplicates across the entire tournament and showing a clear error when blocked.",
      "acceptanceCriteria": [
        "Group headers in the round-robin groups UI can be switched into an editable state and saved by the user.",
        "If the user attempts to rename a group to a name already used by any other group in any stage, the UI blocks the change and shows a clear English error message.",
        "If the user renames a group to a unique value, the updated group name is reflected everywhere that group name is shown (e.g., group tables and schedule views) without requiring a regeneration reset."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoundRobinGroupTable.tsx",
          "operation": "modify",
          "description": "Add an editable state for the group header (e.g., click-to-edit) and wire save/cancel interactions. Use shadcn-ui Input (and any needed composed controls) for the inline editor; Verify the component's usage instructions before implementing. On save, call the store group-rename action; if the new name conflicts with any existing group name in any stage, block the update and display a clear English error (e.g., via sonner toast)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a client-store action to update a group name by stageId + groupId and ensure all dependent UI updates.",
      "acceptanceCriteria": [
        "There is a store action to update a specific group name identified by stageId and groupId.",
        "Updating a group name updates the group in the relevant stage in state and causes React views using that state to re-render accordingly.",
        "Existing behaviors for updating team names and team positions remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tournament/useTournamentStore.ts",
          "operation": "modify",
          "description": "Add an updateGroupName(stageId, groupId, newName) action that updates the group name in the appropriate stage within state. Include a store-level uniqueness check against all group names across all stages (excluding the current group) and return a success/failure result (or equivalent) so the UI can block duplicates without requiring regeneration."
        },
        {
          "path": "frontend/src/features/tournament/types.ts",
          "operation": "modify",
          "description": "Update the TournamentStore/action typing as needed to include the new updateGroupName action and its return shape (if applicable), without changing existing team update and position reorder behaviors."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure Round 2 (and any later round) group UI uses the same serial numbering and position-reorder dropdown as Round 1, and updates serials after group rename.",
      "acceptanceCriteria": [
        "For any stage (including Robin Round 2), each team row shows a serial number in the format \"{groupName}-{position}\" consistent with Robin Round 1.",
        "For any stage (including Robin Round 2), each team row includes the position dropdown and changing it reorders the teams within that group.",
        "After a group rename, serial numbers update to use the new group name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StageSchedulePage.tsx",
          "operation": "modify",
          "description": "Update the groups view to render the round-robin group UI for all generated round-robin stages (not only stageNumber===1), ensuring Robin Round 2 is shown using the existing RoundRobinGroupTable so it inherits the same serial-number format and position dropdown behavior."
        },
        {
          "path": "frontend/src/components/RoundRobinGroupTable.tsx",
          "operation": "modify",
          "description": "Ensure the serial-number display remains derived from the live group.name value (\"{groupName}-{position}\") so renames immediately reflect in-row serial numbers for every stage."
        }
      ]
    }
  ]
}