{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix knockout bracket match counts after Pre-Quarterfinal",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Correct knockout bracket generation so each subsequent round halves the match count by carrying forward only winner placeholders (not full team slots), producing standard single-elimination counts and correct UI match badges.",
      "acceptanceCriteria": [
        "When knockoutStages.preQuarterFinal, quarterFinal, semiFinal, and final are enabled and 16 real teams enter Pre-Quarterfinal, generateKnockoutMatches returns 8 Pre-Quarterfinal matches, 4 Quarterfinal matches, 2 Semifinal matches, and 1 Final match.",
        "The teams carried forward between rounds represent winners only (i.e., after a round with N matches, the next round starts with N placeholder teams), so the next round match count is always half of the prior round’s match count.",
        "KnockoutPage displays the corrected per-round match badges (e.g., Quarterfinal shows “4 matches”, Semifinal shows “2 matches”, Final shows “1 match”) for the same configuration.",
        "The fix does not change qualification logic (which teams qualify) or round naming (Pre-Quarterfinal, Quarterfinal, Semifinal, Final) beyond correcting match counts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tournament/knockoutGenerator.ts",
          "operation": "modify",
          "description": "Fix round-to-round team carry-forward logic so that after generating a round with N matches, the next round starts with N placeholder 'winner' teams (not 2N), ensuring match counts halve each round (8→4→2→1) when all rounds are enabled. Update helper naming/comments as needed to reflect winner-placeholder semantics."
        },
        {
          "path": "frontend/src/pages/KnockoutPage.tsx",
          "operation": "modify",
          "description": "Confirm knockout round grouping and match-count badges rely on the generated match list and remain correct after the generator fix; make any minimal adjustments required so displayed per-round match counts reflect the corrected bracket output (no changes to round names or qualification logic)."
        }
      ]
    }
  ]
}