{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix tournament loading to populate data on tournament page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix tournament loading to navigate to setup page and populate all tournament data when loading from TournamentListDialog",
      "acceptanceCriteria": [
        "When loading a saved tournament from the Manage Tournament dialog, all tournament data (name, teams, groups, stages) populates on the tournament setup page",
        "The tournament setup page displays the loaded tournament data in an editable state",
        "The 'tournament loaded' success message appears only when the data is successfully populated",
        "All tournament configuration fields reflect the loaded tournament's saved state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/tournament/useTournamentStore.ts",
          "operation": "modify",
          "description": "Add view navigation to the loadTournament action by setting currentView to 'setup' after successfully loading and deserializing tournament data. This ensures users are taken to the tournament setup page where they can see and edit the loaded tournament configuration."
        },
        {
          "path": "frontend/src/components/TournamentListDialog.tsx",
          "operation": "modify",
          "description": "Update the handleLoadTournament function to close the dialog after successfully loading a tournament. This prevents the dialog from remaining open and obscuring the newly loaded tournament data on the setup page."
        },
        {
          "path": "frontend/src/pages/TournamentSetupPage.tsx",
          "operation": "modify",
          "description": "Verify that all form inputs (team count, round configs, group counts, advancement rules, knockout stages) properly reflect the loaded tournament state from useTournamentStore. Ensure the page correctly displays pre-populated data when navigated to via tournament loading."
        }
      ]
    }
  ]
}